In [37]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [38]:
df_cloud = pd.read_csv('../Data/downloaded/premios_export.csv')

df_local = pd.read_csv('../Data/processed/premios.csv')

In [39]:
df_cloud.sort_values(by='numero_sorteo', inplace=True)
df_local.sort_values(by='numero_sorteo', inplace=True)

In [40]:
df_cloud = df_cloud.drop(columns='id')
df_cloud

,numero_sorteo,numero_premiado,letras,monto,vendedor,ciudad,departamento
49,390,3129,TT,1000.0,NaN,NaN,NaN
48,390,3080,DT,600.0,NaN,NaN,NaN
47,390,2980,DT,600.0,NaN,NaN,NaN
46,390,2885,TT,900.0,NaN,NaN,NaN
45,390,2880,DT,600.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...
30456,3069,30000,C,700.0,NaN,NaN,NaN
30455,3069,29999,C,700.0,NaN,NaN,NaN
30454,3069,29998,C,700.0,NaN,NaN,NaN
30438,3069,29982,CR,770.0,NaN,NaN,NaN
30421,3069,29965,C,700.0,NaN,NaN,NaN

In [41]:
df_local

,numero_sorteo,numero_premiado,letras,monto,vendedor,ciudad,departamento
49,390,3129,TT,1000.0,NaN,NaN,NaN
48,390,3080,DT,600.0,NaN,NaN,NaN
47,390,2980,DT,600.0,NaN,NaN,NaN
46,390,2885,TT,900.0,NaN,NaN,NaN
45,390,2880,DT,600.0,NaN,NaN,NaN
...,...,...,...,...,...,...,...
30456,3069,30000,C,700.0,NaN,NaN,NaN
30455,3069,29999,C,700.0,NaN,NaN,NaN
30454,3069,29998,C,700.0,NaN,NaN,NaN
30438,3069,29982,CR,770.0,NaN,NaN,NaN
30421,3069,29965,C,700.0,NaN,NaN,NaN

In [42]:
df_cloud.isnull().sum()

numero_sorteo          0
numero_premiado        0
letras                 0
monto                  0
vendedor           29656
ciudad             30032
departamento       30032
dtype: int64

In [43]:
df_local.isnull().sum()

numero_sorteo          0
numero_premiado        0
letras                 0
monto                  0
vendedor           29656
ciudad             30032
departamento       30032
dtype: int64

In [44]:
df_merged = pd.merge(df_cloud, df_local,
                     on=list(df_cloud.columns),  # all columns must match
                     how="outer",
                     indicator=True)

# Step 3: Filter rows that appear ONLY in the cloud DataFrame
df_only_in_cloud = df_merged[df_merged["_merge"] == "left_only"].drop(columns=["_merge"])

In [45]:
df_only_in_cloud

Empty DataFrame
Columns: [numero_sorteo, numero_premiado, letras, monto, vendedor, ciudad, departamento]
Index: []

In [46]:
df_only_in_cloud.to_csv("rows_only_in_cloud.csv", index=False)

In [47]:
df_merged_local = pd.merge(df_local, df_cloud,
                     on=list(df_local.columns),  # all columns must match
                     how="outer",
                     indicator=True)

# Step 3: Filter rows that appear ONLY in the cloud DataFrame
df_only_in_local = df_merged[df_merged["_merge"] == "right_only"].drop(columns=["_merge"])

In [48]:
df_only_in_local

Empty DataFrame
Columns: [numero_sorteo, numero_premiado, letras, monto, vendedor, ciudad, departamento]
Index: []